load-test-frontend.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 100
      rampTo: 500
      name: "Spike"
    - duration: 30
      arrivalRate: 1000
      name: "Crash test"

scenarios:
  - name: "Visit Homepage and Jobs"
    flow:
      - get:
          url: "/"
      - think: 2
      - get:
          url: "/jobs"