load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 100
      rampTo: 500
      name: "Spike"
    - duration: 30
      arrivalRate: 1000
      name: "Crash test"

scenarios:
  - name: "Fetch API Jobs"
    flow:
      - get:
          url: "/api/jobs/public?page=1&limit=10"
      - think: 1
      - get:
          url: "/api/employers/public?page=1"